<template>
  <div class="w-full flex flex-col font-NotoSansKhmer">
    <div class="lg:w-[1920px] xl:w-full md:w-full w-full h-auto">
      <div class="lg:w-[1420px] xl:w-[1420px] w-full md:w-full mx-auto">
        <div class="lg:mt-10 xl:mt-10 md:mt-32 mt-0 text-center">
          <div class="lg:mt-10 xl:mt-10 md:mt-32 mt-0 text-center py-4">
            <h1 class="font-NotoSansKhmer text-primery1">ទាក់ទងមកពួកយើង</h1>
            <h1 class="text-primery1 font-NotoSansKhmer">(Our Contact)</h1>
          </div>
          <div class="w-full">
            <h2
              class="text-textbody font-NotoSansKhmer font-bold text-heading4"
            >
              ជួយឱ្យអ្នកគ្រប់គ្រងអាជីវកម្មស្រួល <br />
              និងរីកចម្រើនលឿន
            </h2>
            <div class="w-[70%] mx-auto py-4">
              <p class="text-body text-textbody text-start font-NotoSansKhmer">
                ប្រឹក្សាយោបល់ ផ្ដល់ដំណោះស្រាយផ្នែកបច្ចេកវិទ្យា
                ដើម្បីឱ្យអតិថិជនទទួលបានគេហទំព័រ
                ឬប្រព័ន្ធគ្រប់គ្រងទិន្នន័យសម្រាប់អាជីវកម្មដែលល្អបំផុត <br />
                បំពេញតម្រូវការរបស់លោកអ្នកបានច្រើនបំផុត និងចំណាយប្រាក់តិចបំផុត។
              </p>
            </div>
          </div>
        </div>
      </div>
      <div
        class="lg:w-[1420px] xl:w-[1420px] w-full grid lg:grid-cols-2 xl:grid-cols-2 md:grid-cols-2 grid-cols-1 mx-auto"
      >
        <div class="lg:w-1/2 xl:w-1/2 md:w-full">
          <div class="w-full flex items-center gap-2 p-2">
            <svg
              xmlns="http://www.w3.org/2000/svg"
              class="w-12 h-12"
              viewBox="0 0 1024 1024"
            >
              <path
                fill="#500192"
                d="M854.4 800.9c.2-.3.5-.6.7-.9C920.6 722.1 960 621.7 960 512s-39.4-210.1-104.8-288c-.2-.3-.5-.5-.7-.8c-1.1-1.3-2.1-2.5-3.2-3.7c-.4-.5-.8-.9-1.2-1.4l-4.1-4.7l-.1-.1c-1.5-1.7-3.1-3.4-4.6-5.1l-.1-.1c-3.2-3.4-6.4-6.8-9.7-10.1l-.1-.1l-4.8-4.8l-.3-.3c-1.5-1.5-3-2.9-4.5-4.3c-.5-.5-1-1-1.6-1.5c-1-1-2-1.9-3-2.8c-.3-.3-.7-.6-1-1C736.4 109.2 629.5 64 512 64s-224.4 45.2-304.3 119.2c-.3.3-.7.6-1 1c-1 .9-2 1.9-3 2.9c-.5.5-1 1-1.6 1.5c-1.5 1.4-3 2.9-4.5 4.3l-.3.3l-4.8 4.8l-.1.1c-3.3 3.3-6.5 6.7-9.7 10.1l-.1.1c-1.6 1.7-3.1 3.4-4.6 5.1l-.1.1c-1.4 1.5-2.8 3.1-4.1 4.7c-.4.5-.8.9-1.2 1.4c-1.1 1.2-2.1 2.5-3.2 3.7c-.2.3-.5.5-.7.8C103.4 301.9 64 402.3 64 512s39.4 210.1 104.8 288c.2.3.5.6.7.9l3.1 3.7c.4.5.8.9 1.2 1.4l4.1 4.7c0 .1.1.1.1.2c1.5 1.7 3 3.4 4.6 5l.1.1c3.2 3.4 6.4 6.8 9.6 10.1l.1.1c1.6 1.6 3.1 3.2 4.7 4.7l.3.3c3.3 3.3 6.7 6.5 10.1 9.6c80.1 74 187 119.2 304.5 119.2s224.4-45.2 304.3-119.2a300 300 0 0 0 10-9.6l.3-.3c1.6-1.6 3.2-3.1 4.7-4.7l.1-.1c3.3-3.3 6.5-6.7 9.6-10.1l.1-.1c1.5-1.7 3.1-3.3 4.6-5c0-.1.1-.1.1-.2c1.4-1.5 2.8-3.1 4.1-4.7c.4-.5.8-.9 1.2-1.4a99 99 0 0 0 3.3-3.7m4.1-142.6c-13.8 32.6-32 62.8-54.2 90.2a444.07 444.07 0 0 0-81.5-55.9c11.6-46.9 18.8-98.4 20.7-152.6H887c-3 40.9-12.6 80.6-28.5 118.3M887 484H743.5c-1.9-54.2-9.1-105.7-20.7-152.6c29.3-15.6 56.6-34.4 81.5-55.9A373.86 373.86 0 0 1 887 484M658.3 165.5c39.7 16.8 75.8 40 107.6 69.2a394.72 394.72 0 0 1-59.4 41.8c-15.7-45-35.8-84.1-59.2-115.4c3.7 1.4 7.4 2.9 11 4.4m-90.6 700.6c-9.2 7.2-18.4 12.7-27.7 16.4V697a389.1 389.1 0 0 1 115.7 26.2c-8.3 24.6-17.9 47.3-29 67.8c-17.4 32.4-37.8 58.3-59 75.1m59-633.1c11 20.6 20.7 43.3 29 67.8A389.1 389.1 0 0 1 540 327V141.6c9.2 3.7 18.5 9.1 27.7 16.4c21.2 16.7 41.6 42.6 59 75M540 640.9V540h147.5c-1.6 44.2-7.1 87.1-16.3 127.8l-.3 1.2A445.02 445.02 0 0 0 540 640.9m0-156.9V383.1c45.8-2.8 89.8-12.5 130.9-28.1l.3 1.2c9.2 40.7 14.7 83.5 16.3 127.8zm-56 56v100.9c-45.8 2.8-89.8 12.5-130.9 28.1l-.3-1.2c-9.2-40.7-14.7-83.5-16.3-127.8zm-147.5-56c1.6-44.2 7.1-87.1 16.3-127.8l.3-1.2c41.1 15.6 85 25.3 130.9 28.1V484zM484 697v185.4c-9.2-3.7-18.5-9.1-27.7-16.4c-21.2-16.7-41.7-42.7-59.1-75.1c-11-20.6-20.7-43.3-29-67.8c37.2-14.6 75.9-23.3 115.8-26.1m0-370a389.1 389.1 0 0 1-115.7-26.2c8.3-24.6 17.9-47.3 29-67.8c17.4-32.4 37.8-58.4 59.1-75.1c9.2-7.2 18.4-12.7 27.7-16.4V327zM365.7 165.5c3.7-1.5 7.3-3 11-4.4c-23.4 31.3-43.5 70.4-59.2 115.4c-21-12-40.9-26-59.4-41.8c31.8-29.2 67.9-52.4 107.6-69.2M165.5 365.7c13.8-32.6 32-62.8 54.2-90.2c24.9 21.5 52.2 40.3 81.5 55.9c-11.6 46.9-18.8 98.4-20.7 152.6H137c3-40.9 12.6-80.6 28.5-118.3M137 540h143.5c1.9 54.2 9.1 105.7 20.7 152.6a444.07 444.07 0 0 0-81.5 55.9A373.86 373.86 0 0 1 137 540m228.7 318.5c-39.7-16.8-75.8-40-107.6-69.2c18.5-15.8 38.4-29.7 59.4-41.8c15.7 45 35.8 84.1 59.2 115.4c-3.7-1.4-7.4-2.9-11-4.4m292.6 0c-3.7 1.5-7.3 3-11 4.4c23.4-31.3 43.5-70.4 59.2-115.4c21 12 40.9 26 59.4 41.8a373.81 373.81 0 0 1-107.6 69.2"
              />
            </svg>
            <div class="w-full">
              <h2 class="text-body text-textbody font-bold">អាស័យដ្ឋាន:</h2>
              <p class="text-link text-linkcol font-NotoSansKhmer">
                <a href="https://maps.app.goo.gl/2nTDojzKmaFsVoxH6"
                  >ភូមិរំចេក៤ សង្កាត់រតនៈ ក្រុងបាត់ដំបង ខេត្តបាត់ដំបង</a
                >
              </p>
            </div>
          </div>
          <div class="w-full flex items-center gap-2 p-2">
            <svg
              xmlns="http://www.w3.org/2000/svg"
              class="w-12 h-12"
              viewBox="0 0 24 24"
            >
              <path
                fill="#500192"
                d="M16.5 12c0-.68-.06-1.34-.14-2h3.38c.16.64.26 1.31.26 2c0 .37-.03.73-.08 1.08c.69.1 1.33.32 1.92.64c.1-.56.16-1.13.16-1.72c0-5.5-4.5-10-10-10C6.47 2 2 6.5 2 12s4.5 10 10 10c.59 0 1.16-.06 1.72-.16A5.9 5.9 0 0 1 13 19c0-.29.03-.57.07-.85c-.32.63-.67 1.24-1.07 1.81c-.83-1.2-1.5-2.53-1.91-3.96h3.72a5.95 5.95 0 0 1 2.59-2.4c.06-.53.1-1.06.1-1.6M12 4.03c.83 1.2 1.5 2.54 1.91 3.97h-3.82c.41-1.43 1.08-2.77 1.91-3.97M4.26 14C4.1 13.36 4 12.69 4 12s.1-1.36.26-2h3.38c-.08.66-.14 1.32-.14 2s.06 1.34.14 2zm.82 2H8c.35 1.25.8 2.45 1.4 3.56A8.008 8.008 0 0 1 5.08 16M8 8H5.08A7.923 7.923 0 0 1 9.4 4.44C8.8 5.55 8.35 6.75 8 8m6.34 6H9.66c-.1-.66-.16-1.32-.16-2s.06-1.35.16-2h4.68c.09.65.16 1.32.16 2s-.07 1.34-.16 2m.25-9.56c1.84.63 3.37 1.9 4.33 3.56h-2.95a15.65 15.65 0 0 0-1.38-3.56m7.91 12.81L17.75 22L15 19l1.16-1.16l1.59 1.59l3.59-3.59z"
              />
            </svg>
            <div class="w-full">
              <h2 class="text-body text-textbody font-bold">គេហទំព័រ:</h2>
              <p class="text-link text-linkcol font-NotoSansKhmer">
                <a href="master.it.system.team@gmail.com">
                  www.masteritsystems.com
                </a>
              </p>
            </div>
          </div>
          <div class="w-full flex items-center gap-2 p-2">
            <svg
              xmlns="http://www.w3.org/2000/svg"
              class="w-12 h-12"
              viewBox="0 0 24 24"
            >
              <path
                fill="#500192"
                d="M21.33 19.035a2.57 2.57 0 0 1-.884 1.432a5.251 5.251 0 0 1-3.738 1.564h-.325a10.973 10.973 0 0 1-4.205-1.087h-.01c-.305-.142-.62-.284-.925-.457a19.127 19.127 0 0 1-4.185-3.18a18.193 18.193 0 0 1-3.9-5.292A11.692 11.692 0 0 1 2.14 8.572a6.38 6.38 0 0 1 .407-3.708a6.827 6.827 0 0 1 1.148-1.432A2.194 2.194 0 0 1 5.29 2.69a2.51 2.51 0 0 1 1.687.935c.457.497 1.015 1.015 1.473 1.493l.63.62c.37.328.599.786.64 1.28c0 .453-.167.89-.468 1.229a9.141 9.141 0 0 1-.62.68l-.203.213c-.118.11-.208.246-.264.397c-.05.147-.07.302-.06.457c.161.431.414.823.74 1.148c.509.69 1.017 1.29 1.535 1.94a12.9 12.9 0 0 0 3.29 2.733c.127.093.273.155.428.182c.134.01.27-.01.396-.06c.355-.209.67-.477.934-.793a2.174 2.174 0 0 1 1.422-.782a2.032 2.032 0 0 1 1.423.61c.203.172.426.406.64.63l.304.314l.315.305l.539.548c.321.285.623.59.904.915c.282.39.409.872.355 1.35m-3.646-6.958a.772.772 0 0 1-.762-.762a4.37 4.37 0 0 0-4.378-4.378a.762.762 0 0 1 0-1.524a5.893 5.893 0 0 1 5.902 5.902a.762.762 0 0 1-.762.762"
              />
              <path
                fill="#500192"
                d="M21.209 11.72a.772.772 0 0 1-.762-.761a7.455 7.455 0 0 0-7.456-7.467a.762.762 0 1 1 0-1.523a8.98 8.98 0 0 1 8.98 8.99a.762.762 0 0 1-.762.762"
              />
            </svg>
            <div class="w-full">
              <h2 class="text-body text-textbody font-bold">ទំនាក់ទំនង:</h2>
              <p class="text-link text-textbody font-NotoSansKhmer">
                095 956 656 / 096 50 21 168
              </p>
            </div>
          </div>
          <div class="w-full flex items-center gap-2 p-2">
            <svg
              xmlns="http://www.w3.org/2000/svg"
              class="w-12 h-12"
              viewBox="0 0 512 512"
            >
              <path
                fill="#500192"
                d="M464 80H48a16 16 0 0 0-16 16v320a16 16 0 0 0 16 16h416a16 16 0 0 0 16-16V96a16 16 0 0 0-16-16M265.82 284.63a16 16 0 0 1-19.64 0L89.55 162.81l19.64-25.26L256 251.73l146.81-114.18l19.64 25.26Z"
              />
            </svg>
            <div class="w-full">
              <h2 class="text-body text-textbody font-bold">អ៊ីមែល:</h2>
              <p class="text-link text-linkcol font-NotoSansKhmer">
                master.it.system.team@gmail.com
              </p>
            </div>
          </div>
          <div class="w-full flex items-center gap-2 p-2">
            <svg
              xmlns="http://www.w3.org/2000/svg"
              class="w-12 h-12"
              viewBox="0 0 24 24"
            >
              <path
                fill="#500192"
                d="M18.72 14.76c.35-.85.54-1.76.54-2.76c0-.72-.11-1.41-.3-2.05c-.65.15-1.33.23-2.04.23A9.07 9.07 0 0 1 9.5 6.34a9.21 9.21 0 0 1-4.73 4.88c-.04.25-.04.52-.04.78A7.27 7.27 0 0 0 12 19.27c1.05 0 2.06-.23 2.97-.64c.57 1.09.83 1.63.81 1.63c-1.64.55-2.91.82-3.78.82c-2.42 0-4.73-.95-6.43-2.66a9.03 9.03 0 0 1-2.24-3.69H2v-4.55h1.09a9.09 9.09 0 0 1 15.33-4.6a8.991 8.991 0 0 1 2.47 4.6H22v4.55h-.06L18.38 18l-5.3-.6v-1.67h4.83zm-9.45-2.99c.3 0 .59.12.8.34a1.136 1.136 0 0 1 0 1.6c-.21.21-.5.33-.8.33c-.63 0-1.14-.5-1.14-1.13c0-.63.51-1.14 1.14-1.14m5.45 0c.63 0 1.13.51 1.13 1.14c0 .63-.5 1.13-1.13 1.13c-.63 0-1.14-.5-1.14-1.13a1.14 1.14 0 0 1 1.14-1.14"
              />
            </svg>
            <div class="w-full">
              <h2 class="text-body text-textbody font-bold">
                ទីប្រឹក្សាតាមតេឡេក្រាម:
              </h2>
              <p class="text-link text-textbody font-NotoSansKhmer">
                095 956 656
              </p>
            </div>
          </div>
        </div>
        <div
          class="lg:full flex flex-col p-3 font-NotoSansKhmer w-full md:w-full"
        >
          <div class="lg:w-[70%] xl:w-[70%] w-full md:w-full mx-auto">
            <div
              class="w-full items-center lg:flex xl:flex md:hidden hidden space-x-4"
            >
              <img src="../assets/image/image 5.png" alt="" />
              <div class="leading-6">
                <h1>Master IT System</h1>
                <h1 class="font-NotoSansKhmer">ម៉ាស្ទ័រអាយធី ស៊ីស្ទឹម</h1>
              </div>
            </div>
            <div class="w-full">
              <h2 class="text-body text-textbody font-bold">
                Facebook: Master-IT System
              </h2>
            </div>
            <div class="w-full">
              <h2 class="text-body text-textbody font-bold">
                YouTube: Master-IT System
              </h2>
            </div>
            <div class="w-full space-y-4">
              <h2 class="text-body text-textbody font-bold">
                Telegram Channel: Master-IT System
              </h2>
              <img
                class="w-[80px] h-[80xp] ml-32"
                src="../assets/image/qr.png"
                alt=""
              />
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>
